<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.lambda_functions.data.archive_file.populate_coffee_pool: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Reading...
module.lambda_functions.data.archive_file.daily_coffee: Read complete after 0s [id=10f3e7bfd18b005e7607502a64ef59a3d3605cd7]
module.lambda_functions.data.archive_file.populate_coffee_pool: Read complete after 0s [id=c1683e077ca7b87d422637f16f084a6a8f022b8d]
module.lambda_functions.aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role: Refreshing state... [id=terraform_aws_lambda_role-dev-20231019175631352300000001]
module.lambda_functions.aws_iam_policy.lambda: Refreshing state... [id=arn:aws:iam::057149530255:policy/aws_iam_policy_for_terraform_aws_lambda_role-dev]
module.lambda_functions.aws_iam_role.lambda: Refreshing state... [id=terraform_aws_lambda_role-dev]
module.dynamodb_tables.aws_dynamodb_table.coffee_pool: Refreshing state... [id=coffee_pool-dev]
module.lambda_functions.aws_lambda_function.daily_coffee: Refreshing state... [id=daily_coffee-dev]
module.lambda_functions.aws_lambda_function.populate_coffee_pool: Refreshing state... [id=populate_coffee_pool-dev]
module.api_app.aws_api_gateway_rest_api.this: Refreshing state... [id=jfrfryrkn3]
module.api_app.aws_api_gateway_resource.root: Refreshing state... [id=sogf0r]
module.api_app.aws_api_gateway_resource.daily_coffee: Refreshing state... [id=undac0]
module.api_app.aws_api_gateway_method.daily_coffee: Refreshing state... [id=agm-jfrfryrkn3-undac0-GET]
module.api_app.aws_api_gateway_integration.daily_coffee: Refreshing state... [id=agi-jfrfryrkn3-undac0-GET]
module.api_app.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_app.aws_api_gateway_deployment.dev: Refreshing state... [id=ujfnb3]
module.api_app.aws_api_gateway_stage.dev: Refreshing state... [id=ags-jfrfryrkn3-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.lambda_functions.aws_iam_policy.batchwrite_coffee_pool will be created
  + resource "aws_iam_policy" "batchwrite_coffee_pool" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for coffee_pool table batch write access"
      + id          = (known after apply)
      + name        = "terraform_dynamodb_batchwrite_policy-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "dynamodb:BatchWriteItem"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:table/coffee_pool*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda_functions.aws_iam_policy.cloudwatch_logs will be created
  + resource "aws_iam_policy" "cloudwatch_logs" {
      + arn         = (known after apply)
      + description = "AWS IAM Policy for cloudwatch logs access"
      + id          = (known after apply)
      + name        = "terraform_cloudwatch_logs_policy-dev"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda_functions.aws_iam_policy.lambda will be destroyed
  # (because aws_iam_policy.lambda is not in configuration)
  - resource "aws_iam_policy" "lambda" {
      - arn         = "arn:aws:iam::057149530255:policy/aws_iam_policy_for_terraform_aws_lambda_role-dev" -> null
      - description = "AWS IAM Policy for managing aws lambda role" -> null
      - id          = "arn:aws:iam::057149530255:policy/aws_iam_policy_for_terraform_aws_lambda_role-dev" -> null
      - name        = "aws_iam_policy_for_terraform_aws_lambda_role-dev" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAQ2TTAUCHSAN466CRT" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.lambda_functions.aws_iam_role.daily_coffee will be created
  + resource "aws_iam_role" "daily_coffee" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_daily_coffee_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda_functions.aws_iam_role.lambda will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::057149530255:role/terraform_aws_lambda_role-dev" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-10-19T17:56:31Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform_aws_lambda_role-dev" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::057149530255:policy/aws_iam_policy_for_terraform_aws_lambda_role-dev",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform_aws_lambda_role-dev" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQ2TTAUCH56JP3GOWN" -> null
    }

  # module.lambda_functions.aws_iam_role.populate_coffee_pool will be created
  + resource "aws_iam_role" "populate_coffee_pool" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_populate_coffee_pool_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role will be destroyed
  # (because aws_iam_role_policy_attachment.attach_iam_policy_to_iam_role is not in configuration)
  - resource "aws_iam_role_policy_attachment" "attach_iam_policy_to_iam_role" {
      - id         = "terraform_aws_lambda_role-dev-20231019175631352300000001" -> null
      - policy_arn = "arn:aws:iam::057149530255:policy/aws_iam_policy_for_terraform_aws_lambda_role-dev" -> null
      - role       = "terraform_aws_lambda_role-dev" -> null
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.daily_coffee_cloudwatch_logs will be created
  + resource "aws_iam_role_policy_attachment" "daily_coffee_cloudwatch_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_daily_coffee_role-dev"
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_batchwrite_coffee_pool will be created
  + resource "aws_iam_role_policy_attachment" "populate_coffee_pool_batchwrite_coffee_pool" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_populate_coffee_pool_role-dev"
    }

  # module.lambda_functions.aws_iam_role_policy_attachment.populate_coffee_pool_cloudwatch_logs will be created
  + resource "aws_iam_role_policy_attachment" "populate_coffee_pool_cloudwatch_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_populate_coffee_pool_role-dev"
    }

  # module.lambda_functions.aws_lambda_function.daily_coffee will be updated in-place
  ~ resource "aws_lambda_function" "daily_coffee" {
        id                             = "daily_coffee-dev"
      ~ role                           = "arn:aws:iam::057149530255:role/terraform_aws_lambda_role-dev" -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lambda_functions.aws_lambda_function.populate_coffee_pool will be updated in-place
  ~ resource "aws_lambda_function" "populate_coffee_pool" {
        id                             = "populate_coffee_pool-dev"
      ~ last_modified                  = "2023-11-12T22:24:19.000+0000" -> (known after apply)
      ~ role                           = "arn:aws:iam::057149530255:role/terraform_aws_lambda_role-dev" -> (known after apply)
      ~ source_code_hash               = "n+jlXOBeVRysX3zc4GIdg1lYhZFJDRFf+SWYqdwbatc=" -> "dM6pzBmSRPvHr1ke1c2WyOgRMD5HbXu+YhYI1qjnXl8="
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 7 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @erikmichel-dev, Action: `pull_request`